# 生徒は入力済みの学習記録を修正・削除することができる

生徒はカレンダーから入力済みの学習記録を選択して時間を修正したり、記録を削除したりできる。
変更・削除はページをリロードしても保持される。なお編集時は教材を変更できない。

## カレンダーから記録を選択して学習時間を変更することができる

* 本日 60 分の学習記録がある生徒としてダッシュボードを開く
* 今日のカレンダーセルをクリックする
* 学習記録の編集ボタンをクリックする
* 学習時間を "1" 時間 "30" 分に変更する
* 記録を保存する
* 会員画面をリロードする
* 今日の学習記録が "90" 分で保存されている

## 学習記録の編集中は教材を変更できない

* 本日 60 分の学習記録がある生徒としてダッシュボードを開く
* 今日のカレンダーセルをクリックする
* 学習記録の編集ボタンをクリックする
* 教材プルダウンが変更できない状態になっている

## カレンダーから記録を選択して削除することができる

* 本日 60 分の学習記録がある生徒としてダッシュボードを開く
* 今日のカレンダーセルをクリックする
* 学習記録の削除ボタンをクリックする
* 会員画面をリロードする
* 学習記録が "0" 件保存されている
